<?php

declare(strict_types=1);

return [
    // Australia
    'AU' => 'Австралия',
    'AU-ACT' => 'Австралия - Австралийская столичная территория',
    'AU-NSW' => 'Австралия - Новый Южный Уэльс',
    'AU-NT' => 'Австралия - Северная территория',
    'AU-QLD' => 'Австралия - Квинсленд',
    'AU-SA' => 'Австралия - Южная Австралия',
    'AU-TAS' => 'Австралия - Тасмания',
    'AU-VIC' => 'Австралия - Виктория',
    'AU-WA' => 'Австралия - Западная Австралия',

    // Austria
    'AT' => 'Австрия',
    'AT-1' => 'Австрия - Бургенланд',
    'AT-2' => 'Австрия - Каринтия',
    'AT-3' => 'Австрия - Нижняя Австрия',
    'AT-4' => 'Австрия - Верхняя Австрия',
    'AT-5' => 'Австрия - Зальцбург',
    'AT-6' => 'Австрия - Штирия',
    'AT-7' => 'Австрия - Тироль',
    'AT-8' => 'Австрия - Форарльберг',
    'AT-9' => 'Австрия - Вена',

    // Belarus
    'BY' => 'Беларусь',

    // Belgium
    'BE' => 'Бельгия',

    // Brazil
    'BR' => 'Бразилия',

    // Bulgaria
    'BG' => 'Болгария',

    // Canada
    'CA' => 'Канада',
    'CA-AB' => 'Канада - Альберта',
    'CA-BC' => 'Канада - Британская Колумбия',
    'CA-MB' => 'Канада - Манитоба',
    'CA-NB' => 'Канада - Нью-Брансуик',
    'CA-NL' => 'Канада - Ньюфаундленд и Лабрадор',
    'CA-NT' => 'Канада - Северо-Западные территории',
    'CA-NS' => 'Канада - Новая Шотландия',
    'CA-NU' => 'Канада - Нунавут',
    'CA-ON' => 'Канада - Онтарио',
    'CA-PE' => 'Канада - Остров Принца Эдуарда',
    'CA-QC' => 'Канада - Квебек',
    'CA-SK' => 'Канада - Саскачеван',
    'CA-YT' => 'Канада - Юкон',

    // Czech Republic
    'CZ' => 'Чехия',

    // Denmark
    'DK' => 'Дания',

    // Estonia
    'EE' => 'Эстония',

    // Finland
    'FI' => 'Финляндия',

    // France
    'FR' => 'Франция',
    'FR-57' => 'Франция - Мозель',
    'FR-67' => 'Франция - Нижний Рейн',
    'FR-68' => 'Франция - Верхний Рейн',
    'FR-GF' => 'Франция - Французская Гвиана',
    'FR-GUA' => 'Франция - Гваделупа',
    'FR-LRE' => 'Франция - Реюньон',
    'FR-MQ' => 'Франция - Мартиника',

    // Germany
    'DE' => 'Германия',
    'DE-BB' => 'Германия - Бранденбург',
    'DE-BE' => 'Германия - Берлин',
    'DE-BW' => 'Германия - Баден-Вюртемберг',
    'DE-BY' => 'Германия - Бавария',
    'DE-HB' => 'Германия - Бремен',
    'DE-HE' => 'Германия - Гессен',
    'DE-HH' => 'Германия - Гамбург',
    'DE-MV' => 'Германия - Мекленбург-Передняя Померания',
    'DE-NI' => 'Германия - Нижняя Саксония',
    'DE-NW' => 'Германия - Северный Рейн-Вестфалия',
    'DE-RP' => 'Германия - Рейнланд-Пфальц',
    'DE-SH' => 'Германия - Шлезвиг-Гольштейн',
    'DE-SL' => 'Германия - Саар',
    'DE-SN' => 'Германия - Саксония',
    'DE-ST' => 'Германия - Саксония-Анхальт',
    'DE-TH' => 'Германия - Тюрингия',

    // Greenland
    'GL' => 'Гренландия',

    // Iceland
    'IS' => 'Исландия',

    // Ireland
    'IE' => 'Ирландия',

    // Italy
    'IT' => 'Италия',
    'IT-32' => 'Италия - Южный Тироль',

    // Latvia
    'LV' => 'Латвия',

    // Liechtenstein
    'FL' => 'Лихтенштейн',

    // Lithuania
    'LT' => 'Литва',

    // Luxembourg
    'LU' => 'Люксембург',

    // Mexico
    'MX' => 'Мексика',

    // Netherlands
    'NL' => 'Нидерланды',

    // Norway
    'NO' => 'Норвегия',

    // Poland
    'PL' => 'Польша',

    // Portugal
    'PT' => 'Португалия',
    'PT-20' => 'Португалия - Азорские острова',
    'PT-30' => 'Португалия - Мадейра',

    // Russia
    'RU' => 'Россия',

    // Spain
    'ES' => 'Испания',

    // Sweden
    'SE' => 'Швеция',

    // Switzerland
    'CH' => 'Швейцария',
    'CH-AG' => 'Швейцария - Аргау',
    'CH-AI' => 'Швейцария - Аппенцелль-Иннерроден',
    'CH-AR' => 'Швейцария - Аппенцелль-Аусерроден',
    'CH-BE' => 'Швейцария - Берн',
    'CH-BL' => 'Швейцария - Базель-Ландшафт',
    'CH-BS' => 'Швейцария - Базель-Штадт',
    'CH-FR' => 'Швейцария - Фрибур',
    'CH-GE' => 'Швейцария - Женева',
    'CH-GL' => 'Швейцария - Гларус',
    'CH-GR' => 'Швейцария - Граубюнден',
    'CH-JU' => 'Швейцария - Юра',
    'CH-LU' => 'Швейцария - Люцерн',
    'CH-NE' => 'Швейцария - Невшатель',
    'CH-NW' => 'Швейцария - Нидвальден',
    'CH-OW' => 'Швейцария - Обвальден',
    'CH-SG' => 'Швейцария - Санкт-Галлен',
    'CH-SH' => 'Швейцария - Шаффхаузен',
    'CH-SO' => 'Швейцария - Золотурн',
    'CH-SZ' => 'Швейцария - Швиц',
    'CH-TG' => 'Швейцария - Тургау',
    'CH-TI' => 'Швейцария - Тичино',
    'CH-UR' => 'Швейцария - Ури',
    'CH-VD' => 'Швейцария - Во',
    'CH-VS' => 'Швейцария - Вале',
    'CH-ZG' => 'Швейцария - Цуг',
    'CH-ZH' => 'Швейцария - Цюрих',

    // Turkey
    'TR' => 'Турция',

    // Ukraine
    'UA' => 'Украина',

    // United Kingdom
    'GB' => 'Великобритания',
    'GB-NIR' => 'Великобритания - Северная Ирландия',
    'GB-SCT' => 'Великобритания - Шотландия',

    // USA
    'US' => 'Соединённые Штаты Америки',
];